Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360
Provides access to the BIM360 state of the application which is hosting the API.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.Accounts
Gives access to all current Accounts.
Youu'll only get these once SignedIn.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.GetRestApi(Autodesk.Navisworks.Api.Bim360.AccountInfo)
Rest Api access.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.GetRestApiV3(Autodesk.Navisworks.Api.Bim360.AccountInfo)
Rest Api access.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.HasAnyBim360ModelOpen
Returns true if any BIM 360 Models are loaded.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.IsSignedIn
BIM 360 SignIn support.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.ParseBim360Uri(System.String)
Attempts to parse a string as a BIM 360 URI, and then determines resource information.
Throws System.ArgumentNullException:
Argument 'input' is null.
Throws System.FormatException:
Failed to parse 'input' into a BIM 360 URI.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.RefreshBeginning
Occurs when BIM 360 data is about to refresh.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.RefreshComplete
Occurs when the refresh of BIM 360 data is complete.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationBim360.TryParseBim360Uri(System.String,Autodesk.Navisworks.Api.Bim360.ResourceInfo@)
Attempts to parse a string as a BIM 360 URI, and then determines resource information.